{
  "blockType": "text-editor",
  "data": {
    "content": {
      "content": [
        {
          "content": [
            {
              "text": "Navigation provides users with a structured and intuitive way to navigate different pages, sections or features of your website or application. It tells users where they are at all times and ensures they can easily get to where they need to go.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "attrs": {
            "level": 2
          },
          "content": [
            {
              "text": "Pattern scope",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "This pattern provides guidance for when and how to use navigation elements. The arrangement of navigation elements depends on the complexity of the interface you are designing, the type of content or features accessed and the overall user experience goals. Use this pattern to provide consistency that helps users navigate your website or application easily and efficiently.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "attrs": {
            "level": 2
          },
          "content": [
            {
              "text": "When to use it",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "Use the pattern to indicate the structure and hierarchy of your site or application content. When deciding on your application’s navigation, it’s important to:",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "content": [
            {
              "content": [
                {
                  "content": [
                    {
                      "text": "Display navigation in websites or applications with two or more pages to indicate content hierarchy and help users orient themselves.",
                      "type": "text"
                    }
                  ],
                  "type": "paragraph"
                }
              ],
              "type": "listItem"
            },
            {
              "content": [
                {
                  "content": [
                    {
                      "text": "Simplify your hierarchy to help users locate the information they want in the fewest clicks, to reduce the user's cognitive load.",
                      "type": "text"
                    }
                  ],
                  "type": "paragraph"
                }
              ],
              "type": "listItem"
            },
            {
              "content": [
                {
                  "content": [
                    {
                      "text": "Label effectively with clear and concise label descriptions or visual cues, such as descriptive icons, to specify the information a navigation item or tab directs users to.",
                      "type": "text"
                    }
                  ],
                  "type": "paragraph"
                }
              ],
              "type": "listItem"
            }
          ],
          "type": "bulletList"
        },
        {
          "attrs": {
            "level": 2
          },
          "content": [
            {
              "text": "Navigation hierarchy",
              "type": "text"
            }
          ],
          "type": "heading"
        },
        {
          "content": [
            {
              "text": "Navigation organizes content by placing it within a hierarchy. Elements at the top of the hierarchy are the most prominent and accessible, connecting users to lower elements in the hierarchy.",
              "type": "text"
            }
          ],
          "type": "paragraph"
        },
        {
          "content": [
            {
              "text": "Use one or both of the two navigation structures below:",
              "type": "text"
            }
          ],
          "type": "paragraph"
        }
      ],
      "type": "doc"
    }
  },
  "id": "mMbBwMk4cz",
  "size": null
}
